{"meta":{"title":"Turning Over","subtitle":"alphac","description":null,"author":"alpha c","url":"http://alphac.cn"},"pages":[{"title":"","date":"2018-05-22T15:02:20.838Z","updated":"2018-05-22T15:02:20.839Z","comments":true,"path":"404.html","permalink":"http://alphac.cn/404.html","excerpt":"","text":""}],"posts":[{"title":"Portal External Authentication - Facebook","slug":"Portal-External-Authentication-Facebook","date":"2018-06-04T07:38:07.000Z","updated":"2018-06-04T09:37:40.301Z","comments":true,"path":"2018/06/04/Portal-External-Authentication-Facebook/","link":"","permalink":"http://alphac.cn/2018/06/04/Portal-External-Authentication-Facebook/","excerpt":"","text":"In CRM Portal, you are able to register it with your personal email address, then you are able to sign in the Portal internally. Actually, you don’t need to register Portal with email address if the Portal enable other providers for external authentication, eg: Facebook, Google, etc. Afterwards, you can sign in the Portal with these external accounts. Here I will introduce how to enable these external authentication in CRM Portal. Facebook first. Log on your Facebook and go to https://developers.facebook.com to create an new App. Fill out the “Display Name” and “Contact Email” and Create App ID. After click “Create App ID”, you may receive a “Security Check” dialog, type the code. In the following “Add a Product” page, select “Facebook Login” tile as we will use Facebook account to log on Portal. Afterwards, click Settings -&gt; Basic on the left panel, then fill out the “Privacy Policy URL” and select one “category”. On the bottom, click “Add Platform”, choose the “Website” and type your Portal URL in it. Then Save changes. Make a note of the “App ID” and “App Secret”, we will use them later. PS: For the “Privacy Policy URL”, we can google it and apply some free Private Policy, eg: from https://termsfeed.com/ or https://www.freeprivacypolicy.com https://www.youtube.com/watch?v=BIrC8ke_JWw&amp;feature=youtu.be Navigate to Facebook Login -&gt; Settings, fill out the “Valid OAuth Redirect URLs” as https:///signin-facebook. Then Save the changes. Then go to App Reviews, make this app public. Go to the Portal associated CRM organization, navigate to Portals -&gt; Site Settings, fill out the Site Settings “Authentication/OpenAuth/Facebook/AppId“ and “Authentication/OpenAuth/Facebook/AppSecret“ with the “App ID” and “App Secret” we have noted before. Go to the Portal sign in page, we can see the “Facebook” button appears. Now you can sign in with your Facebook account. Cheers!!","categories":[],"tags":[{"name":"CRM Portal","slug":"CRM-Portal","permalink":"http://alphac.cn/tags/CRM-Portal/"}]},{"title":"Portal External Authentication - ADFS(WS-Federation)","slug":"Portal-External-Authentication-ADFS-WS-Federation","date":"2018-06-04T06:46:32.000Z","updated":"2018-06-04T07:06:30.734Z","comments":true,"path":"2018/06/04/Portal-External-Authentication-ADFS-WS-Federation/","link":"","permalink":"http://alphac.cn/2018/06/04/Portal-External-Authentication-ADFS-WS-Federation/","excerpt":"","text":"","categories":[],"tags":[{"name":"CRM Portal","slug":"CRM-Portal","permalink":"http://alphac.cn/tags/CRM-Portal/"}]},{"title":"Value missing in CRM Portal dropdown list","slug":"Value-missing-in-CRM-Portal-dropdown-list","date":"2018-05-29T14:29:57.000Z","updated":"2018-05-30T01:59:45.851Z","comments":true,"path":"2018/05/29/Value-missing-in-CRM-Portal-dropdown-list/","link":"","permalink":"http://alphac.cn/2018/05/29/Value-missing-in-CRM-Portal-dropdown-list/","excerpt":"","text":"In CRM Portal, we are able to make a Lookup field on an entity form render as a dropdown list, just add an entity form metadata. For example, in an OOB CSS Portal, we add the Source Campaign (campaignid) lookup field to the contact us page (an Lead entity form). In the contact us entity form, add an entity form metadata record for the Source Campaign (campaignid) and make sure the Control Style is Render Lookup as Dropdown. Then we can see the lookup field show as a dropdown list. However, after recent Portal release (about around v8.4.2.19), the values of the dropdown list don’t show, like an empty list. But if we change the dropdown back the lookup, the values show again in the pop up dialog. This is because there is a design change (should be a security enhancement), we need to provide additional Append permission for the Lookup field related entity. For above example, as the Source Campaign (campaignid) is a Lead entity attribute and contains the relationship between Lead entity and Campaign entity. So please go to CRM &gt; Portals &gt; Entity Permissions, create a new entity permission record, Name: “any name you like”; Entity Name: campaign; Website: “the portal website”; Scope: Global; Privileges section, make sure the Append is checked. Scroll down to the Web Roles section, you can add the web roles you want this kind of Portal users able to see the values in the dropdown list. Here I choose Anonymous Users, as contact us page can be accessed anonymously. PS: if we only choose Anonymous Users web role, after we sign in the portal, we are unable to see the values in the dropdown. Then, save the record, clear portal cache, we can see the values in the dropdown list show again. Cheers!!","categories":[],"tags":[{"name":"CRM Portal","slug":"CRM-Portal","permalink":"http://alphac.cn/tags/CRM-Portal/"}]},{"title":"Hello World","slug":"hello-world","date":"2018-01-07T09:40:43.857Z","updated":"2018-01-07T09:40:43.857Z","comments":true,"path":"2018/01/07/hello-world/","link":"","permalink":"http://alphac.cn/2018/01/07/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}